src/ex_Tabakon/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Организации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ПрименениеСистемНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПрименениеСистемНалогообложения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Enums/ТипыСистемНалогообложенияККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыСистемНалогообложенияККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УСНДоходРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНДоходРасход5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСНДоходРасход7</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Catalogs/Организации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
&Вместо("СНООрганизации")
Функция ТБКСНООрганизации(Организация)
	
	Результат = Новый Структура("СНО, ОбъектНалогообложения, ОсвобожденОтНДС");
	
	СНООрганизации = РегистрыСведений.ПрименениеСистемНалогообложения.СистемаНалогообложенияОрганизации(Организация);
	
	Если СНООрганизации <> Неопределено Тогда
		
		Если СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
			Результат.СНО 					= "УСН";
			Результат.ОбъектНалогообложения = "Доход";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			Результат.СНО 					= "УСН";
			Результат.ОбъектНалогообложения = Нстр("ru='Доход минус расход'");
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
			Результат.СНО = "ОСН";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
			Результат.СНО = "ЕНВД";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
			Результат.СНО = "Патент";	
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
			Результат.СНО = "ЕСН";
			//Марк 2025-02-13
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход5 Тогда
			Результат.СНО = "УСНДоходРасход5";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход7 Тогда
			Результат.СНО = "УСНДоходРасход7";
			//КонецМарк
		КонецЕсли;
		
		Результат.ОсвобожденОтНДС = СНООрганизации.ОсвобожденОтНДС;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТБКСистемаНалогообложенияПриИзмененииВместо(Элемент)
	Если СистемаНалогообложения = "УСН" или СистемаНалогообложения = "УСНДоходРасход5" или СистемаНалогообложения = "УСНДоходРасход7" Тогда
		Элементы.УСНОбъектНалогообложения.Видимость = Истина;
		Элементы.ОсвобожденОтНДС.Видимость 			= Ложь;
		
	ИначеЕсли СистемаНалогообложения = "ОСН" ИЛИ СистемаНалогообложения = "ЕСН" Тогда
		Элементы.УСНОбъектНалогообложения.Видимость = Ложь;
		Элементы.ОсвобожденОтНДС.Видимость 			= Истина;
	Иначе
		Элементы.УСНОбъектНалогообложения.Видимость = Ложь;
		Элементы.ОсвобожденОтНДС.Видимость 			= Ложь;
	КонецЕсли;
КонецПроцедуры
